---
title: AreaBasedLoadBoundaryLineData
classe: Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# AreaBasedLoadBoundaryLineData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId BottomLevelId { get; set; }` | `areaBasedLoadBoundaryLineData.BottomLevelId` | ElementId |
| `Boolean IsValidObject { get; }` | `areaBasedLoadBoundaryLineData.IsValidObject` | Boolean |
| `ElementId TopLevelId { get; set; }` | `areaBasedLoadBoundaryLineData.TopLevelId` | ElementId |
| `Void Dispose()` | `areaBasedLoadBoundaryLineData.Dispose()` | Void |
| `ISet<ElementId> GetLevelIdsInRange()` | `areaBasedLoadBoundaryLineData.GetLevelIdsInRange()` | ISet<ElementId> |
| `Boolean IsElevationWithinRange(Double)` | `areaBasedLoadBoundaryLineData.IsElevationWithinRange(elev)` | Boolean |
| `Boolean IsLevelWithinRange(ElementId)` | `areaBasedLoadBoundaryLineData.IsLevelWithinRange(levelId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```